"""
Написать рекурсивную функцию fibonacci, которая будет возвращать n-ый элемент
"""


def fibonacci(n):
    if n <0:
        print("Неверное")
    уlif

if __name__ == "__main__":
    print(fibonacci(5))

